app/Controllers/API/OrderAPIController.php

    public function getAllOrders()
    {
        $orderModel = new OrderModel();
        $orders = $orderModel->findAll();
---
SELECT *
FROM `orders`

    public function getOrderById($id)
    {
        $orderModel = new OrderModel();
        $orderItemModel = new OrderItemModel();

        $order = $orderModel->find($id);
        if (!$order) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Order not found'
            ], 404);
        }

        $orderItems = $orderItemModel->where('order_id', $id)->findAll();
---
SELECT *
FROM `orders`
WHERE `orders`.`id` = '2'
SELECT *
FROM `order_items`
WHERE `order_id` = '2'