app/Controllers/CategoryController.php

SELECT *
FROM `categories`
---
    public function index()
    {
        $model = new CategoryModel();
        $data['categories'] = $model->findAll();

SELECT *
FROM `categories`
WHERE `categories`.`id` = '5'
---
    public function editindex($id)
    {
        $model = new CategoryModel();
        $data['category'] = $model->find($id);

DELETE FROM `categories`
WHERE `id` IN ('6')
---
    public function delete($id)
    {
        $model = new CategoryModel();
        $model->delete($id);