app/Controllers/CustomerController.php

SELECT *
FROM `customers`
---
    public function index()
    {
        $model = new CustomerModel();
        $data['customers'] = $model->findAll();

SELECT *
FROM `customers`
WHERE `customers`.`id` = '5'
---
    public function editindex($id)
    {
        $model = new CustomerModel();
        $data['customer'] = $model->find($id);