app/Controllers/OrderController.php

SELECT *
FROM `orders`
---
    public function index()
    {
        $model = new OrderModel();
        $data['orders'] = $model->findAll();

SELECT *
FROM `products`
SELECT *
FROM `customers`
SELECT *
FROM `orders`
WHERE `orders`.`id` = '2'
SELECT *
FROM `order_items`
WHERE `order_id` = '2'
---
    public function editindex($id)
    {
        $productModel = new ProductModel();
        $customerModel = new CustomerModel();
        $orderModel = new OrderModel();
        $orderItemModel = new OrderItemModel();
        $data['products'] = $productModel->findAll();
        $data['customers'] = $customerModel->findAll();
        $data['order'] = $orderModel->find($id);
        $data['order_items'] = $orderItemModel->where('order_id', $id)->findAll();

DELETE FROM `order_items`
WHERE `order_id` = '3'
INSERT INTO `order_items` (`order_id`, `product_id`, `quantity`, `price`, `created_at`, `updated_at`) VALUES ('3', '4', 1, 1499.99, '2025-04-19 16:32:21', '2025-04-19 16:32:21')
UPDATE `orders` SET `total_amount` = 1549.98, `updated_at` = '2025-04-19 16:32:21'
WHERE `orders`.`id` IN ('3')
---
    public function edit($id)
    {
        $orderModel = new OrderModel();
        $orderItemModel = new OrderItemModel();

        $customerId = $this->request->getPost('customer_id');
        $products = $this->request->getPost('products');

        // 1. Cập nhật lại order chính
        $orderModel->update($id, [
            'customer_id' => $customerId,
            'status' => 'pending'
        ]);

        // 2. Xoá tất cả order_item cũ
        $orderItemModel->where('order_id', $id)->delete();

        $totalAmount = 0;
        foreach ($products as $item) {
            $price = floatval($item['price']);
            $qty = intval($item['qty']);
            $subtotal = $price * $qty;
            $totalAmount += $subtotal;

            $orderItemModel->insert([
                'order_id' => $id,
                'product_id' => $item['product_id'],
                'quantity' => $qty,
                'price' => $price,
            ]);
        }
        $orderModel->update($id, ['total_amount' => $totalAmount]);