app/Controllers/ProductController.php

SELECT *
FROM `products`
---
    public function index()
    {
        $model = new ProductModel();
        $data['products'] = $model->findAll();

SELECT *
FROM `categories`
---
    public function createindex()
    {
        $categoryModel = new CategoryModel();
        $data['categories'] = $categoryModel->findAll();

SELECT *
FROM `products`
WHERE `products`.`id` = '3'
SELECT *
FROM `categories`
---
    public function editindex($id)
    {
        $model = new ProductModel();
        $categoryModel = new CategoryModel();
        $data['product'] = $model->find($id);
        $data['categories'] = $categoryModel->findAll();

DELETE FROM `products`
WHERE `id` IN ('8')
---
    public function delete($id)
    {
        $model = new ProductModel();
        $model->delete($id);